import '../model/exam.dart';

final examList = [
  Exam("Веб програмирање", DateTime(2025, 11, 10, 9, 0), ["Lab12", "Lab13"]),

  Exam("Напредни бази на податоци", DateTime(2025, 11, 12, 14, 0), [
    "Lab12",
    "Lab13",
    "Lab200a",
    "Lab215",
  ]),

  Exam("Мобилни информациски системи", DateTime(2025, 12, 14, 10, 0), [
    "Lab3",
    "Lab2",
  ]),

  Exam("Алгоритми и податочни структури", DateTime(2025, 11, 5, 8, 0), [
    "Lab12",
    "Lab13",
    "Lab200v",
  ]),

  Exam("Структурно програмирање", DateTime(2025, 11, 30, 12, 0), [
    "Lab12",
    "Lab13",
    "Lab200a",
    "Lab2",
  ]),

  Exam("Дизајн на образовен софтвер", DateTime(2025, 11, 15, 11, 0), ["AMFG"]),

  Exam("Оперативни системи", DateTime(2025, 11, 20, 9, 0), [
    "Lab12",
    "Lab13",
    "Lab200a",
  ]),

  Exam("Компјутерски мрежи и бебедност", DateTime(2025, 11, 22, 13, 0), [
    "Lab12",
    "Lab13",
    "Lab200a",
  ]),

  Exam("Вештачка интелигенција", DateTime(2025, 11, 2, 9, 0), ["Lab2", "Lab3"]),

  Exam("Објектно ориентирано програмирање", DateTime(2025, 11, 10, 8, 0), [
    "Lab13",
    "Lab12",
  ]),
];
